// pages/aboutUS/aboutUS.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
 text_1: '  “凡凡拼车”小程序(以下简称"小程序")，主要是解决大家回老家或外出，因购买不到车票和需要拼车的需求，老乡们也许有很多拼车群，但到用车的时候，很多的聊天记录和文字，无法让我们第一时间匹配到适合自己行程的信息。小程序的主要功能就是帮助大家统计行程列表和提供发布行程的功能，全部免费！面对老乡小程序能有什么坏心思呢，只是想让乡愁再也不是一张张票根。',
 text_2: '  小程序郑重承诺，小程序不获取用户的任何隐私信息，只用微信官方公开的头像等信息来区别用户身份，所有功能都免费提供给老乡使用，小程序有不足，也有需要完善的功能，小程序会逐步优化迭代，尽量满足老乡的出行需求。',
 text_3: '  小程序有三愿：\n  愿我们国家繁荣富强！\n  愿我们家乡蒸蒸日上！\n  愿我们老乡幸福安康！',
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})